package baseball;

public class Application {
    public static void main(String[] args) {
    	/*
    	 *  •기본적으로 1부터 9까지 서로 다른 수로 이루어진 3자리의 수를 맞추는 게임이다.
			•같은 수가 같은 자리에 있으면 스트라이크, 다른 자리에 있으면 볼, 같은 수가 전혀 없으면 포볼 또는 낫싱이란 힌트를 얻고,
			그 힌트를 이용해서  먼저 상대방(컴퓨터)의 수를 맞추면 승리한다.
			•[예]  상대방(컴퓨터)의 수가 425일 때, 
					123을 제시한 경우 : 1스트라이크, 
					456을  제시한 경우 : 1스트라이크 1볼,
					789를 제시한  경우 : 낫싱 
			•위 숫자 야구게임에서 상대방의 역할을 컴퓨터가 한다. 
				컴퓨터는 1에서 9까지 서로 다른 임의의 수 3개를 선택한다.
				게임 플레이어는 컴퓨터가 생각하고 있는 3개의  숫자를 입력하고, 
				컴퓨터는 입력한 숫자에 대한 결과를 출력한다.
			•이 같은 과정을 반복해 컴퓨터가 선택한 3개의 숫자를 모두  맞히면 게임이 종료된다.
			•게임을 종료한 후 게임을 다시 시작하거나 완전히 종료할 수 있다.
			•사용자가 잘못된 값을  입력할 경우 [ERROR]로 시작하는 에러 메시지를 출력하고 게임을 계속 진행할 수 있어야 한다.
			
			1. 3자리 랜덤 값 생성 함수 : nextstep.utils.Randoms.pickNumberInRange() 활용
    	    2. 사용자 입력 함수 : nextstep.utils.Console.readLine() 활용
    	 */
    	
    	/* 
    	 * * 사용자 재시작/종료 입력
    	 * * 게임 재시작/종료
    	 * * 게임 진행
    	 * * 3자리 숫자 생성00
    	 * * 사용자 정답 입력
    	 * * 정답 판정
    	 * 
    	 */
    	Game game = new Game();
    	
    	while(game.getContinueYn()) {
    		game.startGame();
    	}
    	
    	System.out.println("종료");
    }
    
    
}
